<?php
$units = array(
    // масса
    'gram' => array(
        'gram',
        'г',
        'граммов',
        'граммам',
        'граммы',
        'гр',
        'граммами',
        'грамм',
        'грамма',
    ),

    'microgram' => array(
        'microgram',
        'микрограммов',
        'микрограмма',
        'мкг',
        'микрограммам',
        'микрограммы',
        'микрограмм',
        'микрограммами',
    ),

    'milligram' => array(
        'milligram',
        'миллиграмма',
        'миллиграммам',
        'миллиграммами',
        'миллиграмм',
        'миллиграммов',
        'миллиграммы',
        'мг',
    ),

    'kilogram' => array(
        'kilogram',
        'килограммов',
        'килограммами',
        'кг',
        'килограмма',
        'килограмм',
        'килограммы',
        'килограммам',
    ),
    
    // время
    'millisecond' => array(
        'millisecond',
        'миллисекунды',
        'миллисекунд',
        'миллисекундам',
        'миллисекундами',
        'миллисекунда',
        'мс',
    ),

    'second' => array(
        'second',
        'секундами',
        'с',
        'секунд',
        'секунда',
        'секунды',
        'секундам',
    ),

    'minute' => array(
        'minute',
        'мин',
        'минуты',
        'минутами',
        'минута',
        'минутам',
        'минут',
    ),

    'hour' => array(
        'hour',
        'часы',
        'часам',
        'ч',
        'часами',
        'час',
        'часов',
        'часа',
    ),

    'day' => array(
        'day',
        'дней',
        'днями',
        'дня',
        'д',
        'дням',
        'дни',
        'день',
    ),

    'week' => array(
        'week',
        'нед',
        'неделям',
        'недели',
        'неделями',
        'неделя',
        'недель',
    ),

    // длина
    'picometer' => array(
        'picometer',
        'пикометрами',
        'пикометров',
        'пм',
        'пикометр',
        'пикометры',
        'пикометра',
        'пикометрам',
    ),

    'nanometer' => array(
        'nanometer',
        'нм',
        'нанометров',
        'нанометры',
        'нанометрами',
        'нанометрам',
        'нанометра',
        'нанометр',
    ),

    'micrometer' => array(
        'micrometer',
        'микрометра',
        'микрометр',
        'мкм',
        'микрометров',
        'микрометрам',
        'микрометры',
        'микрометрами',
    ),

    'millimeter' => array(
        'millimeter',
        'миллиметра',
        'мм',
        'миллиметры',
        'миллиметрам',
        'миллиметров',
        'миллиметр',
        'миллиметрами',
    ),

    'centimeter' => array(
        'centimeter',
        'сантиметрами',
        'сантиметрам',
        'сантиметра',
        'сантиметр',
        'см',
        'сантиметров',
        'сантиметры',
    ),

    'meter' => array(
        'meter',
        'метрами',
        'метры',
        'метров',
        'м',
        'метра',
        'метр',
        'метрам',
    ),

    // сила тока
    'milliampere' => array(
        'milliampere',
        'миллиамперам',
        'мА',
        'миллиамперы',
        'ма',
        'миллиамперов',
        'миллиамперами',
        'миллиампера',
        'миллиампер',
    ),

    'ampere' => array(
        'ampere',
        'ампер',
        'амперами',
        'амперов',
        'амперы',
        'амперам',
        'А',
        'ампера',
    ),

    // напряжение
    'millivolt' => array(
        'millivolt',
        'мВ',
        'милливольт',
    ),

    'volt' => array(
        'volt',
        'вольты',
        'вольта',
        'В',
        'в',
        'вольт',
    ),

    'kilovolt' => array(
        'kilovolt',
        'кВ',
        'киловольт',
    ),

    'megavolt' => array(
        'megavolt',
        'мегавольт',
        'МВ',
    ),

    // температура
    'degree_celsius' => array(
        'degree_celsius',
        '°C',
        'цельсий',
        'градусами Цельсия',
        'градус Цельсия',
        'градусы цельсия',
        'градусов цельсия',
    ),

    'degree_fahrenheit' => array(
        'degree_fahrenheit',
        'фаренгейты',
        'F',
        'градус Фаренгейта',
        '°F',
        'фаренгейт',
    ),

    'kelvin' => array(
        'kelvin',
        'кельвины',
        'кельвинами',
        'кельвинам',
        'кельвина',
        'кельвинов',
        'К',
        'кельвин',
    ),
    
);